wolfSSL/wolfBoot/test-app/app_stm32h5.c
        printf("\t");
        for (i = 0; i < LINE_LEN; i++) {
            if (i < length)
                printf("%02x ", buffer[i]);
            else
                printf("   ");
        }
        if (dumpChars) {
            printf("| ");
            for (i = 0; i < sz; i++) {
                if (buffer[i] > 31 && buffer[i] < 127)
                    printf("%c", buffer[i]);
                else
                    printf(".");
            }
        }
        printf("\r\n");

        buffer += sz;
        length -= sz;
    }
}

static int cmd_info(const char *args)
{
    int i;
    uint32_t cur_fw_version, update_fw_version;
    uint32_t n_keys;
    uint16_t hdrSz;
    uint8_t boot_part_state = IMG_STATE_NEW, update_part_state = IMG_STATE_NEW;

#ifdef TZEN
    cur_fw_version = wolfBoot_nsc_current_firmware_version();
    update_fw_version = wolfBoot_nsc_update_firmware_version();

    wolfBoot_nsc_get_partition_state(PART_BOOT, &boot_part_state);
    wolfBoot_nsc_get_partition_state(PART_UPDATE, &update_part_state);
#else
    cur_fw_version = wolfBoot_current_firmware_version();
    update_fw_version = wolfBoot_update_firmware_version();

    wolfBoot_get_partition_state(PART_BOOT, &boot_part_state);
    wolfBoot_get_partition_state(PART_UPDATE, &update_part_state);
#endif

    printf("\r\n");
    printf("System information\r\n");
    printf("====================================\r\n");
    printf("Flash banks are %sswapped.\r\n", ((FLASH_OPTSR_CUR & (FLASH_OPTSR_SWAP_BANK)) == 0)?"not ":"");
    printf("Firmware version : 0x%lx\r\n", cur_fw_version);
    printf("Current firmware state: %s\r\n", part_state_name(boot_part_state));
    if (update_fw_version != 0) {
        if (update_part_state == IMG_STATE_UPDATING)
            printf("Candidate firmware version : 0x%lx\r\n", update_fw_version);
        else
            printf("Backup firmware version : 0x%lx\r\n", update_fw_version);
        printf("Update state: %s\r\n", part_state_name(update_part_state));
        if (update_fw_version > cur_fw_version) {
            printf("'reboot' to initiate update.\r\n");
        } else {
            printf("Update image older than current.\r\n");
        }
    } else {
        printf("No image in update partition.\r\n");
    }

#ifndef WOLFBOOT_NO_SIGN
    printf("\r\n");
    printf("Bootloader OTP keystore information\r\n");
    printf("====================================\r\n");
    n_keys = keystore_num_pubkeys();
    printf("Number of public keys: %lu\r\n", n_keys);
    for (i = 0; i < n_keys; i++) {
        uint32_t size = keystore_get_size(i);
        uint32_t type = keystore_get_key_type(i);
        uint32_t mask = keystore_get_mask(i);
        uint8_t *keybuf = keystore_get_buffer(i);

        printf("\r\n");
        printf("  Public Key #%d: size %lu, type %lx, mask %08lx\r\n", i,
                size, type, mask);
        printf("  ====================================\r\n  ");
        print_hex(keybuf, size, 0);
    }
#else
    printf("\r\n");
    printf("Signing disabled (SIGN=NONE)\r\n");
#endif
    return 0;
}

static int cmd_success(const char *args)
{
#ifdef TZEN
    wolfBoot_nsc_success();
#else
    wolfBoot_success();
#endif
    printf("update success confirmed.\r\n");
    return 0;
}

static int cmd_random(const char *args)
{
#ifdef WOLFCRYPT_TZ_PSA
    uint32_t rand = 0;
    psa_status_t status = psa_generate_random((uint8_t *)&rand, sizeof(rand));
    if (status != PSA_SUCCESS) {
        printf("Failed to generate PSA random number (%ld)\r\n",
               (long)status);
        return -1;
    }
    printf("Today's lucky number: 0x%08lX\r\n", rand);
    printf("Brought to you by PSA crypto + HW TRNG in Secure world\r\n");
#elif defined(WOLFCRYPT_SECURE_MODE)
    WC_RNG rng;
    int ret;
    uint32_t rand;

    ret = wc_InitRng(&rng);
    if (ret != 0) {
        printf("Failed to initialize RNG\r\n");
        return -1;
    }
    ret = wc_RNG_GenerateBlock(&rng, (byte *)&rand, sizeof(rand));
    if (ret != 0) {
        printf("Failed to generate random number\r\n");
        wc_FreeRng(&rng);
        return -1;
    }
    printf("Today's lucky number: 0x%08lX\r\n", rand);
    printf("Brought to you by wolfCrypt's DRBG fed by HW TRNG in Secure world\r\n");
    wc_FreeRng(&rng);
#else
    printf("Feature only supported with WOLFCRYPT_TZ=1\n");
#endif
    return 0;
}

static int cmd_timestamp(const char *args)
{
    struct timespec tp = {};
    clock_gettime(0, &tp);
    printf("Current timestamp: %lu.%03lu\r\n",
        (long unsigned int)tp.tv_sec, tp.tv_nsec/1000000);
    printf("Current systick: %u\r\n", jiffies);
    printf("VTOR: 0x%08lx\r\n", (*(volatile uint32_t *)(0xE000ED08)));
    return 0;
}

#if defined(WOLFBOOT_ATTESTATION_TEST) && defined(WOLFCRYPT_TZ_PSA)
static int run_attestation_test(void)
{
    uint8_t challenge[PSA_INITIAL_ATTEST_CHALLENGE_SIZE_64];
    uint8_t token[1024];
    size_t token_size = 0;
    psa_status_t status;
    size_t i;

    for (i = 0; i < sizeof(challenge); i++) {
        challenge[i] = (uint8_t)i;
    }

    status = psa_initial_attest_get_token(challenge, sizeof(challenge),
                                          token, sizeof(token), &token_size);
    if (status != PSA_SUCCESS) {
        printf("attest: get token failed (%d)\r\n", status);
        return -1;
    }
    printf("attest: token size %lu bytes\r\n", (unsigned long)token_size);
    print_hex(token, (uint32_t)token_size, 1);
    return 0;
}
#endif

#ifdef WOLFCRYPT_TZ_PSA
/* Hash helpers for app-side measurement printing. */
#if defined(WOLFBOOT_HASH_SHA256)
#define APP_HASH_HDR HDR_SHA256
#define APP_HASH_SIZE (32u)
typedef wc_Sha256 app_hash_t;
#define app_hash_init(h) wc_InitSha256((h))
#define app_hash_update(h, data, len) \
    wc_Sha256Update((h), (const byte *)(data), (word32)(len))
#define app_hash_final(h, out) wc_Sha256Final((h), (byte *)(out))
#elif defined(WOLFBOOT_HASH_SHA384)
#define APP_HASH_HDR HDR_SHA384
#define APP_HASH_SIZE (48u)
typedef wc_Sha384 app_hash_t;
#define app_hash_init(h) wc_InitSha384((h))
#define app_hash_update(h, data, len) \
    wc_Sha384Update((h), (const byte *)(data), (word32)(len))
#define app_hash_final(h, out) wc_Sha384Final((h), (byte *)(out))
#elif defined(WOLFBOOT_HASH_SHA3_384)
#define APP_HASH_HDR HDR_SHA3_384
#define APP_HASH_SIZE (48u)
typedef wc_Sha3 app_hash_t;
#define app_hash_init(h) wc_InitSha3_384((h), NULL, INVALID_DEVID)
#define app_hash_update(h, data, len) \
    wc_Sha3_384_Update((h), (const byte *)(data), (word32)(len))
#define app_hash_final(h, out) wc_Sha3_384_Final((h), (byte *)(out))
#else
#define APP_HASH_HDR 0
#define APP_HASH_SIZE (0u)
typedef int app_hash_t;
#define app_hash_init(h) (void)(h)
#define app_hash_update(h, data, len) (void)(h), (void)(data), (void)(len)
#define app_hash_final(h, out) (void)(h), (void)(out)
#endif

static int hash_region(uintptr_t address, uint32_t size, uint8_t *out)
{
    app_hash_t hash;
    const uint8_t *ptr = (const uint8_t *)address;
    uint32_t pos = 0;

    if (out == NULL || size == 0 || APP_HASH_SIZE == 0u) {
        return -1;
    }

