wolfSSL/wolfBoot/test-app/app_stm32h5.c
    app_hash_init(&hash);

    while (pos < size) {
        uint32_t chunk = size - pos;
        if (chunk > 256) {
            chunk = 256;
        }
        app_hash_update(&hash, ptr + pos, chunk);
        pos += chunk;
    }

    app_hash_final(&hash, out);
    return 0;
}

static int run_psa_boot_attestation(void)
{
    psa_status_t status;
    uint8_t challenge[PSA_INITIAL_ATTEST_CHALLENGE_SIZE_64];
    uint8_t token[1024];
#if (APP_HASH_SIZE > 0u)
    uint8_t hash_buf[APP_HASH_SIZE];
#endif
    size_t queried_token_size;
    size_t emitted_token_size;
    int ret = 0;
    size_t i;

    printf("PSA boot attestation: start\r\n");

    printf("  step 1: TODO verify boot image post-boot\r\n");
    printf("  step 2: TODO read boot image measurement (HDR_HASH)\r\n");

    printf("  step 3: compute wolfBoot measurement\r\n");
#if defined(WOLFBOOT_PARTITION_BOOT_ADDRESS) && defined(ARCH_FLASH_OFFSET)
#if (APP_HASH_SIZE > 0u)
    if (ret == 0) {
        uintptr_t start = (uintptr_t)ARCH_FLASH_OFFSET;
        uintptr_t end = (uintptr_t)WOLFBOOT_PARTITION_BOOT_ADDRESS;
        if (end <= start) {
            printf("  step 3: invalid wolfBoot region\r\n");
            ret = -1;
        } else if (hash_region(start, (uint32_t)(end - start), hash_buf) != 0) {
            printf("  step 3: wolfBoot hash failed\r\n");
            ret = -1;
        } else {
            printf("  step 3: wolfBoot hash (%u bytes)\r\n",
                   (unsigned int)APP_HASH_SIZE);
            print_hex(hash_buf, APP_HASH_SIZE, 0);
        }
    }
#else
    printf("  step 3: hash algorithm not enabled\r\n");
#endif
#else
    printf("  step 3: wolfBoot region unavailable for hashing\r\n");
#endif

    printf("  step 4: generate attestation challenge\r\n");
    status = psa_generate_random(challenge, sizeof(challenge));
    if (status != PSA_SUCCESS) {
        printf("  step 4: PSA RNG failed (%ld), using deterministic nonce\r\n",
               (long)status);
        for (i = 0; i < sizeof(challenge); i++) {
            challenge[i] = (uint8_t)i;
        }
    } else {
        printf("  step 4: challenge ready (%u bytes)\r\n",
               (unsigned int)sizeof(challenge));
    }

    printf("  step 5: request IAT token size\r\n");
    queried_token_size = 0;
    status = psa_initial_attest_get_token_size(sizeof(challenge),
                                               &queried_token_size);
    if (status != PSA_SUCCESS) {
        printf("  step 5: token size failed (%ld)\r\n", (long)status);
        ret = -1;
    } else {
        printf("  step 5: token size %lu bytes\r\n",
               (unsigned long)queried_token_size);
    }

    printf("  step 6: request exact-size IAT token\r\n");
    if (ret == 0 && queried_token_size <= sizeof(token)) {
        emitted_token_size = 0;
        status = psa_initial_attest_get_token(challenge, sizeof(challenge),
                                              token, queried_token_size,
                                              &emitted_token_size);
        if (status != PSA_SUCCESS ||
            emitted_token_size != queried_token_size) {
            printf("  step 6: size mismatch (status=%ld size=%lu "
                   "expected=%lu)\r\n", (long)status,
                   (unsigned long)emitted_token_size,
                   (unsigned long)queried_token_size);
            ret = -1;
        } else {
            printf("  IAT size match: challenge=64 token=%lu\r\n",
                   (unsigned long)emitted_token_size);
            print_hex(token, (uint32_t)emitted_token_size, 1);
        }
    } else if (ret == 0) {
        printf("  step 6: token buffer too small (%lu > %lu)\r\n",
               (unsigned long)queried_token_size,
               (unsigned long)sizeof(token));
        ret = -1;
    }

    printf("PSA boot attestation: %s\r\n", ret == 0 ? "success" : "failed");

    if (ret == 0)
        asm volatile ("bkpt #0x7f");
    else 
        asm volatile ("bkpt #0x7e");


    return ret;
}
#endif

#ifdef WOLFBOOT_TZ_PKCS11
static int cmd_login_pkcs11(const char *args)
{
    (void)args;
    return test_pkcs11_start();
}
#endif /* WOLFBOOT_TZ_PKCS11 */

static int cmd_benchmark(const char *args)
{
#ifdef WOLFCRYPT_SECURE_MODE
    benchmark_test(NULL);
#endif
    return 0;
}

/* Test command */
static int cmd_test(const char *args)
{
#ifdef WOLFCRYPT_SECURE_MODE
    wolfcrypt_test(NULL);
#endif
    return 0;
}

#if defined(WOLFBOOT_TPM) && !defined(WOLFBOOT_TZ_FWTPM)
#include <wolftpm/tpm2.h>
#include <wolftpm/tpm2_wrap.h>

static int TPM2_PCRs_Print(void)
{
    int rc;
    int pcrCount, pcrIndex;
    GetCapability_In  capIn;
    GetCapability_Out capOut;
    TPML_PCR_SELECTION* pcrSel;
    char algName[24];

    /* List available PCR's */
    XMEMSET(&capIn, 0, sizeof(capIn));
    capIn.capability = TPM_CAP_PCRS;
    capIn.property = 0;
    capIn.propertyCount = 1;
    rc = wolfBoot_tpm2_get_capability(&capIn, &capOut);
    if (rc == TPM_RC_SUCCESS) {
        pcrSel = &capOut.capabilityData.data.assignedPCR;
        printf("Assigned PCR's:\r\n");
        for (pcrCount=0; pcrCount < (int)pcrSel->count; pcrCount++) {

            printf("\t%s: ", wolfBoot_tpm2_get_alg_name(
                pcrSel->pcrSelections[pcrCount].hash, algName, sizeof(algName)));
            for (pcrIndex=0;
                pcrIndex<pcrSel->pcrSelections[pcrCount].sizeofSelect*8;
                pcrIndex++) {
                if ((pcrSel->pcrSelections[pcrCount].pcrSelect[pcrIndex/8] &
                        ((1 << (pcrIndex % 8)))) != 0) {
                    printf(" %d", pcrIndex);
                }
            }
            printf("\r\n");
        }
    }
    return rc;
}

static int cmd_tpm_info(const char *args)
{
    int rc;
    WOLFTPM2_CAPS caps;
    TPML_HANDLE handles;
#ifdef WOLFBOOT_MEASURED_PCR_A
    byte hashBuf[TPM_MAX_DIGEST_SIZE];
    int hashSz;
#endif

    printf("Get TPM 2.0 module information\r\n");

    rc = wolfBoot_tpm2_caps(&caps);
    if (rc == 0) {
        printf("Mfg %s (%d), Vendor %s, Fw %u.%u (0x%x), "
            "FIPS 140-2 %d, CC-EAL4 %d\r\n",
            caps.mfgStr, caps.mfg, caps.vendorStr, caps.fwVerMajor,
            caps.fwVerMinor, caps.fwVerVendor, caps.fips140_2, caps.cc_eal4);
    }

