wolfSSL/wolfBoot/test-app/app_stm32h5.c
    /* List the active persistent handles */
    rc = wolfBoot_tpm2_get_handles(PERSISTENT_FIRST, &handles);
    if (rc >= 0) {
        int i;
        printf("Found %d persistent handles\r\n", rc);
        for (i=0; i<(int)handles.count; i++) {
            printf("\tHandle 0x%x\r\n", (unsigned int)handles.handle[i]);
        }
        rc = 0;
    }

    /* Print the available PCR's */
    if (rc == 0) {
        rc = TPM2_PCRs_Print();
    }

#ifdef WOLFBOOT_MEASURED_PCR_A
    /* Read measured boot PCR */
    if (rc == 0) {
        char algName[24];
        printf("Measured boot: PCR %d - %s\r\n", WOLFBOOT_MEASURED_PCR_A,
            wolfBoot_tpm2_get_alg_name(WOLFBOOT_TPM_PCR_ALG, algName, sizeof(algName)));
        hashSz = 0;
        rc = wolfBoot_tpm2_read_pcr(WOLFBOOT_MEASURED_PCR_A, hashBuf, &hashSz);
        if (rc == 0) {
            int i;
            printf("PCR (%d bytes): ", hashSz);
            for (i = 0; i < hashSz; i++) {
                printf("%02x", hashBuf[i]);
            }
            printf("\r\n");
        }
    }
#endif

    if (rc != 0) {
        char error[100];
        printf("TPM error 0x%x: %s\r\n",
            rc, wolfBoot_tpm2_get_rc_string(rc, error, sizeof(error)));
    }

    return rc;
}

#ifdef WOLFTPM_MFG_IDENTITY

/* Forward declarations */
static void print_signature(const TPMT_SIGNATURE* sig);

static int cmd_tpm_idevid(const char *args)
{
    int rc;
    uint8_t cert[1024];
    uint32_t certSz = (uint32_t)sizeof(cert);
    uint32_t handle = TPM2_IDEVID_CERT_HANDLE;

    rc = wolfBoot_tpm2_read_cert(handle, cert, &certSz);
    if (rc == 0) {
        printf("IDevID Handle 0x%x\r\n", (unsigned int)handle);
        print_hex(cert, certSz, 1);
    }
    else {
        char error[100];
        printf("TPM error 0x%x: %s\r\n",
            rc, wolfBoot_tpm2_get_rc_string(rc, error, sizeof(error)));
    }
    return rc;
}

static int cmd_tpm_iak(const char *args)
{
    int rc;
    uint8_t cert[1024];
    uint32_t certSz = (uint32_t)sizeof(cert);
    uint32_t handle = TPM2_IAK_CERT_HANDLE;

    rc = wolfBoot_tpm2_read_cert(handle, cert, &certSz);
    if (rc == 0) {
        printf("IAK Handle 0x%x\r\n", (unsigned int)handle);
        print_hex(cert, certSz, 1);
    }
    else {
        char error[100];
        printf("TPM error 0x%x: %s\r\n",
            rc, wolfBoot_tpm2_get_rc_string(rc, error, sizeof(error)));
    }
    return rc;
}

static int cmd_tpm_signed_timestamp(const char *args)
{
    int rc;
    WOLFTPM2_KEY aik;
    GetTime_Out getTime;
    TPMS_ATTEST timeAttest;

    rc = wolfBoot_tpm2_get_aik(&aik, NULL, 0);
    if (rc == 0) {
        rc = wolfBoot_tpm2_get_timestamp(&aik, &getTime);
    }
    if (rc == 0) {
        rc = wolfBoot_tpm2_parse_attest(&getTime.timeInfo, &timeAttest);
    }
    if (rc == 0) {
        if (timeAttest.magic != TPM_GENERATED_VALUE) {
            printf("\tError, attested data not generated by the TPM = 0x%X\n",
                (unsigned int)timeAttest.magic);
        }

        printf("TPM with signature attests (type 0x%x):\n", timeAttest.type);
        /* time value in milliseconds that advances while the TPM is powered */
        printf("\tTPM uptime since last power-up (in ms): %lu\n",
            (unsigned long)timeAttest.attested.time.time.time);
        /* time value in milliseconds that advances while the TPM is powered */
        printf("\tTPM clock, total time the TPM has been on (in ms): %lu\n",
            (unsigned long)timeAttest.attested.time.time.clockInfo.clock);
        /* number of occurrences of TPM Reset since the last TPM2_Clear() */
        printf("\tReset Count: %u\n",
            (unsigned int)timeAttest.attested.time.time.clockInfo.resetCount);
        /* number of times that TPM2_Shutdown() or _TPM_Hash_Start have occurred since the last TPM Reset or TPM2_Clear(). */
        printf("\tRestart Count: %u\n",
            (unsigned int)timeAttest.attested.time.time.clockInfo.restartCount);
        /* This parameter is set to YES when the value reported in Clock is guaranteed to be unique for the current Owner */
        printf("\tClock Safe: %u\n",
            timeAttest.attested.time.time.clockInfo.safe);
        /* a TPM vendor-specific value indicating the version number of the firmware */
        printf("\tFirmware Version (vendor specific): 0x%lX\n",
            (unsigned long)timeAttest.attested.time.firmwareVersion);

        print_signature(&getTime.signature);
    }

    if (rc != 0) {
        char error[100];
        printf("TPM get timestamp error 0x%x: %s\r\n",
            rc, wolfBoot_tpm2_get_rc_string(rc, error, sizeof(error)));
    }

    return rc;
}

static void print_signature(const TPMT_SIGNATURE* sig)
{
    char algName[24];
    printf("\tTPM generated %s signature:\n",
        wolfBoot_tpm2_get_alg_name(sig->sigAlg, algName, sizeof(algName)));
    printf("\tHash algorithm: %s\n",
        wolfBoot_tpm2_get_alg_name(sig->signature.any.hashAlg, algName, sizeof(algName)));
    switch (sig->sigAlg) {
        case TPM_ALG_ECDSA:
        case TPM_ALG_ECDAA:
            printf("\tR size: %d\n", sig->signature.ecdsa.signatureR.size);
            print_hex(sig->signature.ecdsa.signatureR.buffer, sig->signature.ecdsa.signatureR.size, 0);
            printf("\tS size: %d\n", sig->signature.ecdsa.signatureS.size);
            print_hex(sig->signature.ecdsa.signatureS.buffer, sig->signature.ecdsa.signatureS.size, 0);
            break;
        case TPM_ALG_RSASSA:
        case TPM_ALG_RSAPSS:
            printf("\tSignature size: %d\n", sig->signature.rsassa.sig.size);
            print_hex(sig->signature.rsassa.sig.buffer, sig->signature.rsassa.sig.size, 0);
            break;
    };
}

static int cmd_tpm_quote(const char *args)
{
    int rc;
    WOLFTPM2_KEY aik;
    Quote_Out quoteResult;
    TPMS_ATTEST quoteAttest;
    uint8_t  pcrArray[1];
    uint32_t pcrArraySz = 0;

#ifdef WOLFBOOT_MEASURED_PCR_A
    pcrArray[0] = WOLFBOOT_MEASURED_PCR_A;
    pcrArraySz++;
#else
    pcrArray[0] = 16; /* test PCR */
    pcrArraySz++;
#endif

    rc = wolfBoot_tpm2_get_aik(&aik, NULL, 0);
    if (rc == 0) {
        rc = wolfBoot_tpm2_quote(&aik, pcrArray, pcrArraySz, &quoteResult);
    }
    if (rc == 0) {
        rc = wolfBoot_tpm2_parse_attest(&quoteResult.quoted, &quoteAttest);
    }
    if (rc == 0) {
        printf("TPM with signature attests (type 0x%x):\n", quoteAttest.type);
        printf("\tTPM signed %lu PCRs\n",
            (unsigned long)quoteAttest.attested.quote.pcrSelect.count);

        printf("\tPCR digest:\n");
        print_hex(quoteAttest.attested.quote.pcrDigest.buffer,
                  quoteAttest.attested.quote.pcrDigest.size, 0);

        print_signature(&quoteResult.signature);
    }
    else {
        char error[100];
        printf("TPM quote error 0x%x: %s\r\n", rc,
            wolfBoot_tpm2_get_rc_string(rc, error, sizeof(error)));
    }
    return rc;
}
#endif /* WOLFTPM_MFG_IDENTITY */
#endif /* WOLFBOOT_TPM && !WOLFBOOT_TZ_FWTPM */

#ifdef WOLFBOOT_TZ_FWTPM
extern int TPM2_IoCb_FwtpmNsc(TPM2_CTX *ctx, INT32 isRead, UINT32 addr,
    BYTE *buf, UINT16 size, void *userCtx);

static int fwtpm_expected_pcr_after_extend(const uint8_t *before,
    const uint8_t *event, uint8_t *expected)
{
    wc_Sha256 sha;
    int rc;

    rc = wc_InitSha256(&sha);
    if (rc == 0) {
        rc = wc_Sha256Update(&sha, before, WC_SHA256_DIGEST_SIZE);
    }
    if (rc == 0) {
        rc = wc_Sha256Update(&sha, event, WC_SHA256_DIGEST_SIZE);
    }
    if (rc == 0) {
        rc = wc_Sha256Final(&sha, expected);
    }

    wc_Sha256Free(&sha);
    return rc;
}

static int fwtpm_seal_unseal_pcr_secret(WOLFTPM2_DEV *dev)
{
    static const uint8_t secret[] = "wolfBoot fwTPM PCR secret";
    uint8_t pcrArray[1] = { 0 };
    uint8_t policyDigest[TPM_MAX_DIGEST_SIZE];
    word32 policyDigestSz = sizeof(policyDigest);
    WOLFTPM2_KEY storage;
    WOLFTPM2_KEYBLOB sealBlob;
    WOLFTPM2_SESSION trialSession;
    WOLFTPM2_SESSION policySession;
    TPMT_PUBLIC sealTemplate;
    Unseal_In unsealIn;
    Unseal_Out unsealOut;
    int rc;

