wolfSSL/wolfBoot/test-app/app_stm32h5.c
    XMEMSET(&storage, 0, sizeof(storage));
    XMEMSET(&sealBlob, 0, sizeof(sealBlob));
    XMEMSET(&trialSession, 0, sizeof(trialSession));
    XMEMSET(&policySession, 0, sizeof(policySession));
    XMEMSET(&sealTemplate, 0, sizeof(sealTemplate));
    XMEMSET(&unsealIn, 0, sizeof(unsealIn));
    XMEMSET(&unsealOut, 0, sizeof(unsealOut));

    rc = wolfTPM2_CreateSRK(dev, &storage, TPM_ALG_ECC, NULL, 0);
    if (rc != TPM_RC_SUCCESS) {
        printf("fwTPM seal SRK failed: 0x%x\r\n", rc);
        return rc;
    }

    rc = wolfTPM2_StartSession(dev, &trialSession, NULL, NULL,
        TPM_SE_TRIAL, TPM_ALG_NULL);
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_PolicyPCR(dev, trialSession.handle.hndl,
            TPM_ALG_SHA256, pcrArray, 1);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_GetPolicyDigest(dev, trialSession.handle.hndl,
            policyDigest, &policyDigestSz);
    }
    wolfTPM2_UnloadHandle(dev, &trialSession.handle);
    if (rc != TPM_RC_SUCCESS) {
        printf("fwTPM seal policy failed: 0x%x\r\n", rc);
        wolfTPM2_UnloadHandle(dev, &storage.handle);
        return rc;
    }

    wolfTPM2_GetKeyTemplate_KeySeal(&sealTemplate, TPM_ALG_SHA256);
    sealTemplate.objectAttributes &= ~TPMA_OBJECT_userWithAuth;
    sealTemplate.authPolicy.size = (UINT16)policyDigestSz;
    XMEMCPY(sealTemplate.authPolicy.buffer, policyDigest, policyDigestSz);

    rc = wolfTPM2_CreateKeySeal_ex(dev, &sealBlob, &storage.handle,
        &sealTemplate, NULL, 0, TPM_ALG_SHA256, pcrArray, 1,
        secret, (int)sizeof(secret));
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_LoadKey(dev, &sealBlob, &storage.handle);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_StartSession(dev, &policySession, NULL, NULL,
            TPM_SE_POLICY, TPM_ALG_NULL);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_PolicyPCR(dev, policySession.handle.hndl,
            TPM_ALG_SHA256, pcrArray, 1);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_SetAuthSession(dev, 0, &policySession,
            TPMA_SESSION_continueSession);
    }
    if (rc == TPM_RC_SUCCESS) {
        wolfTPM2_SetAuthHandleName(dev, 0, &sealBlob.handle);
        unsealIn.itemHandle = sealBlob.handle.hndl;
        rc = TPM2_Unseal(&unsealIn, &unsealOut);
    }

    wolfTPM2_UnloadHandle(dev, &policySession.handle);
    wolfTPM2_UnloadHandle(dev, &sealBlob.handle);
    wolfTPM2_UnloadHandle(dev, &storage.handle);

    if (rc != TPM_RC_SUCCESS) {
        printf("fwTPM unseal failed: 0x%x\r\n", rc);
        return rc;
    }

    if (unsealOut.outData.size != sizeof(secret) ||
            XMEMCMP(unsealOut.outData.buffer, secret, sizeof(secret)) != 0) {
        printf("fwTPM unsealed secret mismatch\r\n");
        return TPM_RC_FAILURE;
    }

    printf("fwTPM unsealed secret: %.*s\r\n",
        unsealOut.outData.size, unsealOut.outData.buffer);
    return TPM_RC_SUCCESS;
}

static int cmd_fwtpm_test(const char *args)
{
    int rc;
    WOLFTPM2_DEV dev;
    WOLFTPM2_CAPS caps;
    uint8_t rnd[16];
    uint8_t pcr[TPM_MAX_DIGEST_SIZE];
    uint8_t pcrBefore[TPM_SHA256_DIGEST_SIZE];
    uint8_t pcrEvent[TPM_SHA256_DIGEST_SIZE];
    uint8_t pcrExpected[TPM_SHA256_DIGEST_SIZE];
    int pcrSz = 0;

    (void)args;

    XMEMSET(&dev, 0, sizeof(dev));
    XMEMSET(&caps, 0, sizeof(caps));
    XMEMSET(rnd, 0, sizeof(rnd));
    XMEMSET(pcr, 0, sizeof(pcr));
    XMEMSET(pcrBefore, 0, sizeof(pcrBefore));
    XMEMSET(pcrEvent, 0, sizeof(pcrEvent));
    XMEMSET(pcrExpected, 0, sizeof(pcrExpected));

    rc = wolfTPM2_Init(&dev, TPM2_IoCb_FwtpmNsc, NULL);
    if (rc != TPM_RC_SUCCESS) {
        printf("fwTPM init failed: 0x%x\r\n", rc);
        return rc;
    }

    rc = wolfTPM2_GetCapabilities(&dev, &caps);
    if (rc == TPM_RC_SUCCESS) {
        printf("fwTPM caps: mfg %s vendor %s fw %u.%u\r\n",
            caps.mfgStr, caps.vendorStr, caps.fwVerMajor, caps.fwVerMinor);
    }

    if (rc == TPM_RC_SUCCESS) {
        int randRc = wolfTPM2_GetRandom(&dev, rnd, sizeof(rnd));
        if (randRc == TPM_RC_SUCCESS) {
            printf("fwTPM random:");
            print_hex(rnd, sizeof(rnd), 0);
        }
        else {
            printf("fwTPM random unavailable: 0x%x\r\n", randRc);
        }
    }

    if (rc == TPM_RC_SUCCESS) {
        pcrSz = sizeof(pcr);
        rc = wolfTPM2_ReadPCR(&dev, 0, TPM_ALG_SHA256, pcr, &pcrSz);
        if (rc == TPM_RC_SUCCESS) {
            XMEMCPY(pcrBefore, pcr, sizeof(pcrBefore));
        }
    }

    if (rc == TPM_RC_SUCCESS) {
        static const uint8_t pcrEventName[] = "wolfBoot fwTPM PCR event";
        rc = wc_Sha256Hash(pcrEventName, sizeof(pcrEventName) - 1U,
            pcrEvent);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = fwtpm_expected_pcr_after_extend(pcrBefore, pcrEvent, pcrExpected);
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = wolfTPM2_ExtendPCR(&dev, 0, TPM_ALG_SHA256, pcrEvent,
            sizeof(pcrEvent));
    }
    if (rc == TPM_RC_SUCCESS) {
        pcrSz = sizeof(pcr);
        rc = wolfTPM2_ReadPCR(&dev, 0, TPM_ALG_SHA256, pcr, &pcrSz);
        if (rc == TPM_RC_SUCCESS) {
            printf("fwTPM PCR0 extended:");
            print_hex(pcr, (uint32_t)pcrSz, 0);
        }
    }
    if (rc == TPM_RC_SUCCESS && (pcrSz != (int)sizeof(pcrExpected) ||
            XMEMCMP(pcr, pcrExpected, sizeof(pcrExpected)) != 0)) {
        printf("fwTPM PCR0 extend mismatch\r\n");
        rc = TPM_RC_FAILURE;
    }
    if (rc == TPM_RC_SUCCESS) {
        rc = fwtpm_seal_unseal_pcr_secret(&dev);
    }

    wolfTPM2_Cleanup(&dev);

    if (rc == TPM_RC_SUCCESS) {
        printf("fwTPM NSC tests passed\r\n");
    }
    else {
        printf("fwTPM NSC tests failed: 0x%x\r\n", rc);
    }

    return rc;
}
#endif /* WOLFBOOT_TZ_FWTPM */


static int parse_cmd(const char *cmd)
{
    int retval = -2;
    int i;
    for (i = 0;; i++) {
        if(COMMANDS[i].fn == NULL)
            break;
        if (strncmp(cmd, COMMANDS[i].name, strlen(COMMANDS[i].name)) == 0) {
            retval = COMMANDS[i].fn(cmd);
            break;
        }
    }
    return retval;
}


