wolfSSL/wolfBoot/test-app/app_stm32h5.c
/* Main loop reading commands from UART */
static void console_loop(void)
{
    int ret;
    int idx = 0;
    char cmd[CMD_BUFFER_SIZE];
    unsigned char c;
    while (1) {
        printf("\r\n");
        printf("cmd> ");
        fflush(stdout);
        idx = 0;
        do {
            ret = uart_rx_isr((uint8_t *)&c, 1);
            if (ret > 0) {
                if ((c >= 32) && (c < 127)) {
                    printf("%c", c);
                    fflush(stdout);
                    cmd[idx++] = (char)c;
                } else if (c == '\r') {
                    printf("\r\n");
                    fflush(stdout);
                    break; /* End of command. Parse it. */
                } else if (c == 0x08) { /* Backspace */
                    if (idx > 0) {
                        printf("%c", 0x08);
                        printf(" ");
                        printf("%c", 0x08);
                        fflush(stdout);
                        idx--;
                    }
                }
            }
        } while (idx < (CMD_BUFFER_SIZE - 1));
        if (idx > 0) {
            cmd[idx] = 0;
            if (parse_cmd(cmd) == -2) {
                printf("Unknown command: %s\r\n", cmd);
            }
        }
    }
}

void isr_usart3(void)
{
    volatile uint32_t reg;
    usr_led_on();
    reg = UART_ISR(UART3);
    if (reg & UART_ISR_RX_NOTEMPTY) {
        if (uart_rx_bytes >= 1023)
            reg = UART_RDR(UART3);
        else
            uart_buf_rx[uart_rx_bytes++] = (unsigned char)(UART_RDR(UART3) & 0xFF);
    }
}

static int uart_rx_isr(unsigned char *c, int len)
{
    uint32_t avail;
    UART_CR1(UART3) &= ~UART_ISR_RX_NOTEMPTY;
    if (len < 0) {
        len = 0;
    }
    avail = uart_rx_bytes - uart_processed;
    if ((uint32_t)len > avail) {
        len = (int)avail;
    }
    if (len > 0) {
        memcpy(c, uart_buf_rx + uart_processed, len);
        uart_processed += len;
        if (uart_processed >= uart_rx_bytes) {
            uart_processed = 0;
            uart_rx_bytes = 0;
            usr_led_off();
        }
    }
    UART_CR1(UART3) |= UART_ISR_RX_NOTEMPTY;
    return len;
}

static int uart_poll(void)
{
    return (uart_rx_bytes > uart_processed)?1:0;
}

void main(void)
{
    int ret;
    uint32_t app_version;

    /* Turn on boot LED */
    boot_led_on();

#ifdef WOLFBOOT_TEST_FILLER
    filler_data[FILLER_SIZE - 1] = 0xAA;
#endif

    /* Enable SysTick */
    systick_enable();

#ifdef TZEN
    app_version = wolfBoot_nsc_current_firmware_version();
#else
    app_version = wolfBoot_current_firmware_version();
#endif

    nvic_irq_setprio(NVIC_USART3_IRQN, 0);
    nvic_irq_enable(NVIC_USART3_IRQN);

    uart_init(115200, 8, 'N', 1);
    UART_CR1(UART3) |= UART_ISR_RX_NOTEMPTY;
    UART_CR3(UART3) |= UART_CR3_RXFTIE;

    printf("========================\r\n");
    printf("STM32H5 wolfBoot demo Application\r\n");
    printf("Copyright 2024 wolfSSL Inc\r\n");
    printf("GPL v3\r\n");
    printf("Version : 0x%lx\r\n", app_version);
    printf("========================\r\n");

#ifdef WOLFCRYPT_TZ_PSA
    ret = psa_crypto_init();
    if (ret == PSA_SUCCESS) {
        printf("PSA crypto init ok\r\n");
    } else {
        printf("PSA crypto init failed (%d)\r\n", ret);
    }
#endif

    cmd_info(NULL);
#if defined(WOLFBOOT_TPM) && !defined(WOLFBOOT_TZ_FWTPM)
    cmd_tpm_info(NULL);
#endif
#ifdef WOLFBOOT_TZ_FWTPM
    ret = cmd_fwtpm_test(NULL);
    if (ret == 0)
        asm volatile ("bkpt #0x7f");
    else
        asm volatile ("bkpt #0x7e");
#endif

#ifdef WOLFCRYPT_TZ_WOLFHSM
    ret = cmd_wolfhsm_test(NULL);
#ifdef WOLFBOOT_TZ_TEST_BKPT
    if (ret == WOLFHSM_TEST_FIRST_BOOT_OK)
        asm volatile ("bkpt #0x7d");
    else if (ret == WOLFHSM_TEST_SECOND_BOOT_OK)
        asm volatile ("bkpt #0x7f");
    else
        asm volatile ("bkpt #0x7e");
#else
    if (ret == WOLFHSM_TEST_FIRST_BOOT_OK || ret == WOLFHSM_TEST_SECOND_BOOT_OK) {
        printf("WOLFHSM_TZ_TEST_PASS\r\n");
        while (1) { }
    } else {
        printf("WOLFHSM_TZ_TEST_FAIL\r\n");
        while (1) { }
    }
#endif
#endif

#if defined(WOLFBOOT_ATTESTATION_TEST) && defined(WOLFCRYPT_TZ_PSA)
    (void)run_attestation_test();
#endif

#ifdef WOLFCRYPT_TZ_PSA
    (void)run_psa_boot_attestation();
#endif

#ifdef WOLFBOOT_PKCS11_TESTAPP
    ret = test_pkcs11_start();
    if (ret == PKCS11_TEST_FIRST_BOOT_OK)
        asm volatile ("bkpt #0x7d");
    else if (ret == PKCS11_TEST_SECOND_BOOT_OK)
        asm volatile ("bkpt #0x7f");
    else
        asm volatile ("bkpt #0x7e");
#endif

    console_loop();

    while(1)
        ;

    /* Never reached */
}



/* Syscall helpers + UART interface for printf */


int _getpid(void)
{
  return 1;
}

int _kill(int pid, int sig)
{
  (void)pid;
  (void)sig;
  return -1;
}

void _exit (int status)
{
  _kill(status, -1);
  while (1) {}    /* Make sure we hang here */
}

int WEAKFUNCTION _read(int file, char *ptr, int len)
{
  (void)file;
  int DataIdx;
  int ret;
  return -1;
}

int _write(int file, char *ptr, int len)
{
  (void)file;
  int DataIdx;

  for (DataIdx = 0; DataIdx < len; DataIdx++)
  {
      uart_tx(*ptr++);
  }
  return len;
}

int _close(int file)
{
  (void)file;
  return -1;
}


int _isatty(int file)
{
  (void)file;
  return 1;
}

int _lseek(int file, int ptr, int dir)
{
  (void)file;
  (void)ptr;
  (void)dir;
  return 0;
}

int _fstat(int file, struct stat *st)
{
  (void)file;
  st->st_mode = S_IFCHR;
  return 0;
}

#ifndef WOLFCRYPT_SECURE_MODE
/* Back-end for malloc, used for token handling */
extern unsigned int _start_heap; /* From linker script: heap memory */
extern unsigned int _heap_size;  /* From linker script: heap limit */

void * _sbrk(unsigned int incr)
{
    static unsigned char *heap = (unsigned char *)&_start_heap;
    static uint32_t heapsize = (uint32_t)(&_heap_size);
    void *old_heap = heap;
    if (((incr >> 2) << 2) != incr)
        incr = ((incr >> 2) + 1) << 2;

    if (heap == NULL)
        heap = (unsigned char *)&_start_heap;
    else
        heap += incr;
    if (((uint32_t)heap - (uint32_t)(&_start_heap)) > heapsize) {
        heap -= incr;
        return NULL;
    }
    return old_heap;
}
#endif
